# Intermediate SQL

## Selecting with data

#### Multiple criteria

In [3]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Multiple criteria
* `OR`, `AND`, `BETWEEN`

In [19]:
# SELECT *
# FROM coats
# WHERE color = 'yellow' OR length = 'short'
sql = """SELECT *
FROM coats
WHERE color = 'yellow' OR length = 'short'
"""
run_statement(sql)

(8397,)

In [ ]:
# SELECT *
# FROM coats
# WHERE color = 'yellow' AND length = 'short'
sql = """
SELECT *
FROM coats
WHERE color = 'yellow' AND length = 'short';
"""
run_statement(sql)

In [20]:
# SELECT *
# FROM coats
# WHERE buttons BETWEEN 1 AND 5;
sql = """
SELECT *
FROM coats
WHERE buttons BETWEEN 1 AND 5;
"""
run_statement(sql)

(6152,)

#### OR operator
* Use `OR` when you need to satisfy at least one condition

#### OR operator
* Correct:

In [5]:
sql = """
SELECT title
FROM films
WHERE release_year = 1994
    OR release_year = 2000
"""
run_statement(sql)

                              0
0            3 Ninjas Kick Back
1        A Low Down Dirty Shame
2    Ace Ventura: Pet Detective
3                Baby's Day Out
4         Beverly Hills Cop III
..                          ...
220                     Whipped
221                Woman on Top
222                 Wonder Boys
223                       X-Men
224         You Can Count on Me

[225 rows x 1 columns]

* Invalid:

In [6]:
sql = """
SELECT title
FROM films
WHERE release_year = 1994
    OR 2000
"""
run_statement(sql)

DatabaseError: ORA-00920: invalid relational operator

### AND operator
* Use `AND if we need to satisfy all criteria
* Correct:

In [7]:
# SELECT title
# FROM films
# WHERE release_year > 1994
#   AND release_year < 2000;
sql = """
SELECT title
FROM films
WHERE release_year > 1994
    AND release_year < 2000
"""
run_statement(sql)

                                  0
0    Ace Ventura: When Nature Calls
1                         Apollo 13
2                         Assassins
3                              Babe
4                          Bad Boys
..                              ...
584                Twin Falls Idaho
585   Universal Soldier: The Return
586                   Varsity Blues
587                  Wild Wild West
588                  Wing Commander

[589 rows x 1 columns]

* Invalid:

In [8]:
sql = """
SELECT title
FROM films
WHERE release_year > 1994
    AND < 2000
"""
run_statement(sql)

DatabaseError: ORA-00936: missing expression

#### AND, OR
* Filter films release in 1994 or 1995, and certified PG or R
* Inclose individual clauses in parentheses

In [9]:
sql = """
SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
    AND (certification = 'PG' OR certification = 'R')
"""
run_statement(sql)

                                0
0              3 Ninjas Kick Back
1          A Low Down Dirty Shame
2                  Baby's Day Out
3           Beverly Hills Cop III
4           Bullets Over Broadway
..                            ...
80                     To Die For
81  Under Siege 2: Dark Territory
82            Vampire in Brooklyn
83                     Virtuosity
84       Welcome to the Dollhouse

[85 rows x 1 columns]

#### BETWEEN, AND

In [10]:
sql = """
SELECT title
FROM films
WHERE release_year >= 1994
    AND release_year <= 2000
"""
run_statement(sql)

                              0
0            3 Ninjas Kick Back
1        A Low Down Dirty Shame
2    Ace Ventura: Pet Detective
3                Baby's Day Out
4         Beverly Hills Cop III
..                          ...
809                     Whipped
810                Woman on Top
811                 Wonder Boys
812                       X-Men
813         You Can Count on Me

[814 rows x 1 columns]

* `>=`, `<=` IS EQUAL TO BETWEEN _ AND _ OR _

In [11]:
sql = """
SELECT title
FROM films
WHERE release_year
    BETWEEN 1994 AND 2000
"""
run_statement(sql)

                              0
0            3 Ninjas Kick Back
1        A Low Down Dirty Shame
2    Ace Ventura: Pet Detective
3                Baby's Day Out
4         Beverly Hills Cop III
..                          ...
809                     Whipped
810                Woman on Top
811                 Wonder Boys
812                       X-Men
813         You Can Count on Me

[814 rows x 1 columns]

#### BETWEEN, AND, OR

In [12]:
sql = """
SELECT title
FROM films
WHERE release_year
BETWEEN 1994 AND 2000 AND country = 'UK'
"""
run_statement(sql)

                                0
0     Four Weddings and a Funeral
1             The Hudsucker Proxy
2                Dead Man Walking
3                       GoldenEye
4                     Richard III
..                            ...
59                         Snatch
60                      The Claim
61                      The Claim
62             The House of Mirth
63  Thomas and the Magic Railroad

[64 rows x 1 columns]